抒情歌鸲-合唱小琉璃 ☆1 -仮,WC,80,40,w,1,2
发条机雷 发条雷 ☆3,WD,75,30,dn^xyz3,3,2
彼岸的旅人 但丁 ☆3,WC,30,∞,u^xyz3,3,2
星圣 欧米伽星云 ☆4,WC,240,∞,aMi^xyz4,4,2,
机甲忍者 刃心 ☆4,WC,130,∞,cr^xyz4,4,2,
No39.希望皇 霍普 ☆4,WC,250,∞,eA^xyz4,4,2,
英豪冠军 英弓王,WB,210,∞,d^xyz4,4,2
CNo.39 希望皇 霍普雷 ☆4,WC,250,∞,ned^xyz4,4,3,
英豪冠军 草雉剑王,WK,150,200,nc^xyz4,4,3,
No91.雷闪龙 ☆4,WC,360,∞,Aar^xyz4,4,5,
暗叛逆超量龙 ☆4,WC,250,∞,j^xyz4,4,2,
始祖守护者 提拉斯 ☆5 -仮,WC,200,∞,,5,2,
电子龙·新星 ☆5,WC,210,∞,eNc^xyz5,5,2,
星圣神龙 托勒密星团M7 ☆6,DFS,270,∞,HNn^xyz6,6,2,
幻兽机 哥萨克龙 ☆7,WG,260,22,Ad^xyz7,7,2,
No.7 幸运条纹人 ☆7,WC,177,∞,rc^xyz7,7,3,
宵星之机神 丁吉尔苏 ☆8 -仮,WC,260,∞,,8,2,
幻子力空母 进取神船号 ☆9,WC,290,∞,eay^xyz9,9,2,
超次元机器人 银河破坏王 ☆10,WC,800,∞,rdcm^xyz10,10,3,
超重型炮塔列车 古斯塔夫最大炮 ☆10,WG,600,∞,Nnrd^xyz10,10,2,