发条机雷 发条雷 ☆3,WC,60,30,dn,3,2
No.30 破灭之酸雾石人 ☆3,WC,300,2,d,3,2
彼岸的旅人 但丁 ☆3,WC,30,∞,u,3,2
星圣 欧米伽星云 ☆4,WC,251,∞,Mi,4,2,
机甲忍者 刃心 ☆4,WC,130,∞,cr,4,2,
No39.希望皇 霍普 ☆4,WC,240,∞,A,4,2,
CNo.39 希望皇 霍普雷 ☆4,WC,240,∞,nd,4,3,
英豪冠军 草雉剑王,WK,150,200,nc,4,3,
No91.雷闪龙 ☆4,WC,440,∞,Ar,4,5,
暗叛逆超量龙 ☆4,WC,250,∞,j,4,2,
始祖守护者 提拉斯 ☆5 -仮,WC,200,∞,,5,2,
电子龙·新星 ☆5,WC,210,∞,c,5,2,
No.6 先史遗产 大西洲巨人 ☆6,WC,260,∞,Hck,6,2,
NO7.幸运条纹人 ☆7,WC,300,∞,rc,7,3,
幻子力空母 进取神船号 ☆9,WC,290,∞,ead,9,2,
超次元机器人 银河破坏王 ☆10,WC,800,∞,rdcm,10,3,