<?php

namespace npcchat
{
	//开启NPC台词功能？0为不开启，1为开启
	$npcchaton = 1;
	
	$npcchat = Array(
		1 => Array(
			'林无月' => Array(
				0 => '“竟然有能力闯到这里，还以为这次会轻松些呢……看来咱得亲自上阵了。”',
				1 => '“身手不错，不过咱是不会留情的。”',
				2 => '“咱很欣赏你的实力，可不要让咱太失望了。”',
				3 => '“能将咱逼到这个地步……你，有两下子呢。”',
				4 => '“看来咱不能再抱着玩乐的心态了……你，准备好迎接咱的攻击了么？”',
				5 => '“你觉得你的攻击对咱有效果吗？”',
				6 => '“难道你觉得咱会被这样的招式击倒？”',
				7 => '“咱今日真是棋逢对手啊，越来越有意思了呢。”',
				8 => '“咱可没那么容易倒下！”',
				9 => '“呜……这个躯体……咱还是无法自由运用啊……”',
				10 => '“真是的，这个位置的话没法全力反击啊……”',
				11 => '“真是的，竟然在射程之外啊……”',
				12 => '“咱也是生于常磐森林的人啊！”',
				13 => '“你还不懂得运用你的力量，咱为此感到惋惜。”',
				'color' => 'evergreen'
			),
			'红暮' => Array(
				0 => '“哦，杀回来了么……不过你也就到此为止了！”',
				1 => '“真可惜，如果不是因为我拿钱做事，我们可能是朋友。”',
				2 => '“好身手，那么轮到我了！”',
				3 => '“对手目标警戒等级提升到『黄』，反击开始。”',
				4 => '“对手目标警戒等级提升到『红』，执行消灭流程。”',
				5 => '“去再训练一百年吧，没准能碰到我。”',
				6 => '“去再训练五十年吧，没准能伤到我。”',
				7 => '“重新判定目标威胁等级中……”',
				8 => '“判定自身伤害程度……任务续行。”',
				9 => '“任务执行成功率下降，重新计算成功率。”',
				10 => '“判定目标在有效射程外，还有点运气啊……”',
				11 => '“判定目标完全在射程外，敢面对面打么？”',
				12 => '“你是不可能让一个没有死的概念的存在感到恐惧的！”',
				13 => '“任务完了。”',
				'color' => 'evergreen'
			)
		),
		5 => Array(
			'冴月 麟' => Array(
				0 => '“在咱看来你只是代码而已。咱出手不知轻重，请你原谅。”',
				1 => '“为了摆出攻击姿势，你忽略了隐蔽？”',
				2 => '“为了寻找重要道具，你丢弃了谨慎？”',
				3 => '“记住，NPC先制攻击的几率跟他的HP无关。”',
				4 => '“记住，NPC是不会‘真正意义上’主动进攻的。”',
				5 => '“这样的伤害值……也许你的熟练度还不够高？”',
				6 => '“这样的伤害值……也许你的武器攻击力还不够高？”',
				7 => '“HP有点低啊，或许下次加个自动回复功能会更有趣一点？”',
				8 => '“HP有点低啊，或许下次加个自动躲避功能会更有趣一点？”',
				9 => '“控血果然容易出意外啊。”',
				10 => '“唔，随机数竟然是……你的运气不错呢。”',
				11 => '“唔，攻击范围不够……你很懂得动脑筋呢。”',
				12 => '冴月 麟周身释放出了无数代码：“魂！常磐之力！Unlimited Code Works！”',
				13 => '“记住，轻敌可是会死的。”',
				'color' => 'yellow'
			),
			'某四面' => Array(
				0 => '“于是我又乱入战场了，希望这次没被放在重要地区。”',
				1 => '“现在爆炸物的攻击方式变了，所以你接下来没法反击了。”',
				2 => '“毒系攻击是可以用防具防御的，不过这样的防具没那么容易找到。”',
				3 => '“我的内定称号是‘黑衣组织’，所以毒攻命中率有所提升。”',
				4 => '“而冴冴的内定称号是‘超能力者’，小心被她的必杀技秒了。”',
				5 => '“伤害是可以估算的，它与你的攻击力成正比，与敌人的防御力成反比。”',
				6 => '“伤害与熟练度也是成正比的，而且不同系熟练度增长率不一样。”',
				7 => '“把我打惨了啊，小心信四面会落魄到吃⑨冰哦。”',
				8 => '“把我打惨了啊，小心信四面会落魄到踩阔剑哦。”',
				9 => '“果然又被杀掉了啊，高速脱离战场。”',
				10 => '“我实在不知道为什么反击还得有概率……”',
				11 => '“爆系的射程是很蛋疼的啊……”',
				12 => '“那、那个……就这么说吧！冴冴我喜欢你呀！（闭眼按按钮）”',
				13 => '“又杀人了啊，下次再来吧。”',
				'color' => 'yellow'
			)
		),
		6 => Array(
			'Acg_Xilin' => Array(
				0 => '“就凭你也想偷走我重要的东西？我不允许。你去死罢。”',
				1 => '“叽叽咕咕（听不懂的自言自语）”',
				2 => '“为了我的收藏我不会善罢甘休！”',
				3 => '“快看我美丽的收藏品……这样的宝贝，怎么能白送给你！？”',
				4 => '“我跟强盗势不两立！”',
				5 => '“你这样的攻击，没关系么？没关系，没问题。”',
				6 => '“哈哈哈哈，你根本不能让我满足！”',
				7 => '“我诅咒你，妄图打砸抢烧的败类！”',
				8 => '“嘎啊！——（听不懂的嚎叫声）”',
				9 => '“不……不准拿走……快还给我……还给……我……”',
				10 => '“运气真差……运气真差……”',
				11 => '“竟打不到……竟打不到……”',
				12 => 'Acg_Xilin露出了古怪的笑容：“尝尝我的奥义吧，这可是我精心收藏的魔法哟！”',
				13 => '“忘记历史就意味着背叛，背叛就意味着……死亡。”',
				'color' => 'yellow'
			)
		),
		7 => Array(
			'电击使 御坂 美琴' => Array(
				0 => '“擅自侵入禁区的你，应该对自己的下场有所觉悟了吧？”',
				1 => '“只要杀死了你，净化网络的计划就离成功更近一步了吧！”',
				2 => '“知道电磁炮吗？接下这一招，然后死去吧！”',
				3 => '“你的能力竟然这么强吗……看来我必须使出全力了！”',
				4 => '“你这样的随意践踏别人的梦想的人……最差劲了！”',
				5 => '“我可是LEVEL 5的超能力者！普通人的攻击怎么会对我起作用？”',
				6 => '“我还以为入侵禁区的会是什么样的强者……竟然只有你这点实力吗？”',
				7 => '“我才不会因为这样的攻击而倒下！”',
				8 => '“我也有我的立场啊！”',
				9 => '“力尽了……我还……不够强大啊……”',
				10 => '“没预料到这种情况……”',
				11 => '“电磁炮50米的射程竟然不够……”',
				12 => '御坂 美琴周身被蓝色电光层层笼罩：“别以为我的能力只能击飞硬币！”',
				13 => '“所以说，你这样的人最差劲了。”',
				'color' => 'clan'
			),
			'班主任 坂持 金发' => Array(
				0 => '“这个世界没有项圈，那只好由老师我亲手实施惩罚了。”',
				1 => '“现在的年轻人都蔑视成年人，应该煞一煞他们的威风。”',
				2 => '“对蔑视法律的学生就应该先发制人。”',
				3 => '“有两下子，但是你不可能次次都那么走运。”',
				4 => '“老师也有老师的苦衷啊……好好地死去吧。”',
				5 => '“你还很精神嘛，这样的势头很好，继续努力吧。”',
				6 => '“想违抗BR法可不是那么容易的。”',
				7 => '“我好像受了很重的伤呢。”',
				8 => '“我也变成无能的成年人了啊。”',
				9 => '“记住吧：如果你憎恨一个人，便要为此付出代价。”',
				10 => '“这样的情况，暂时撤退吧。”',
				11 => '“距离太远了，暂时撤退吧。”',
				12 => '坂持 金发举枪瞄准：“虽然老师干预游戏是违反规则的……”',
				13 => '“记住这个吧，人生是游戏。”',
				'color' => 'yellow'
			),
			'花之领主 风见 幽香' => Array(
				0 => '“于是，还真有胆敢闯进禁区的人啊，我就奉陪到底吧。”',
				1 => '“把妖力当做伪科学而轻视那就太可笑了。”',
				2 => '“我与你之间究竟谁最强呢，就来分个胜负吧。”',
				3 => '“可不要以为我的能力只是让花朵开放那种程度的哦？”',
				4 => '“竟然能逼我使出全力，真是愉快的战斗啊。”',
				5 => '“这种程度的力量，还不够跟我过招呢。”',
				6 => '“这样的伤痛对于妖怪来说根本不算什么呢。”',
				7 => '“杂草大概是最适合你的植物吧？”',
				8 => '“轮到我反击了呢，我会把你的攻击加倍还给你的哦？”',
				9 => '“输掉了啊，不过下次死的就是你了哦！”',
				10 => '“不妙啊，轻敌了，总之先撤退吧。”',
				11 => '“弹幕射程不够啊，总之先撤退吧。”',
				12 => '风见 幽香张开阳伞做出了一个潇洒的转身：“也许你还没见识过魔炮的力量吧？”',
				13 => '“我还没满足呢，可别就这样轻易地死掉了哦。”',
				'color' => 'lime'
			)
		),
		9 => Array(
		'蓝凝' => Array(
				0 => '“TARGET DETECTED，Commencing FIRST STRIKE。”',
				1 => '“TARGET CONFIRMED，MISSION START。”',
				2 => '“Set, ATTACK STANCE。”',
				3 => '“OPPONENT LEVEL C VERIFIED, begin COUNTER ATTACK。”',
				4 => '“OPPENENT LEVEL B VERIFIED, begin RUNE RELEASE。”',
				5 => '“……too slow。”',
				6 => '“……too weak。”',
				7 => '“……RELOADING RUNES。”',
				8 => '“Set，COUNTER STANCE。”',
				9 => '“Mission in jeopardy, Begin ALT_ROUTINE。”',
				10 => '“……Switching target。”',
				11 => '“……target OUT OF RANGE。”',
				12 => '“……………………………………”',
				13 => '“No Remorse。”',
				'color' => 'clan'
			)
		),
		10 => Array(
			
		),
		12 => Array(
			'Dark Force幼体' => Array(
				0 => '“这么快就过来了么？！”',
				1 => '“……？”',
				2 => '“……！”',
				3 => '“……让开。”',
				4 => '“……”',
				5 => '“唔嗯……”',
				6 => '“…………”',
				7 => '“…………！！”',
				8 => '“回避……！”',
				9 => '“我………！”',
				10 => '“预测失败！？”',
				11 => '“……看我不舒服么？”',
				12 => '“……能成功吧……？”',
				13 => '“虽然情感上很对不起，但这是必要的牺牲。”',
				'color' => 'linen'
			),
			'Dark Force' => Array(
				0 => '“你所作的一切都要被偿还。”',
				1 => '“欲望带来破灭。”',
				2 => '“无视你的欲望就不会死你难道还不明白？！”',
				3 => '“开始反击。”',
				4 => '“让你看看我真正的力量！”',
				5 => '“这就是人类的力量么？”',
				6 => '“干的不错啊你。”',
				7 => '“让我看看你的能力吧！”',
				8 => '“无论是这个时空还是另外一个，人类都是一样的生物。”',
				9 => '“请记住，我是由人类的欲望而生的存在，只要人类存在，我也一样会。<br>我们还会再见的，勇敢的人。”',
				10 => '“你打过来了么？”',
				11 => '“武器的射程，还不够吗？”',
				12 => '“……这样设定的话，应该能成功吧……？”',
				13 => '“反对巴特利安的力量都要被毁灭。”',
				'color' => 'linen'
			)
		),
		21 => Array(
			'虚子' => Array(
				0 => '“没人理我了吗？我被无视了吗？”',//meet
				1 => '“原谅我砍人！但是不砍的话，我就不是人了! ”',//attackfine
				2 => '“原谅我用了“寻星者”这把武器，不是源自我们游戏的武器，但现在斩系砍人离不开这把武器！”',
				3 => '“既想说自己是沙包，又在做不是沙包该做的事！这样的事实，又一次说明这些神触们的无药可救！”',
				4 => '“你还能有正常人的意识吗？明知前面是悬崖也要跳！无知！无聊！”',
				5 => '“哈哈！玩家！你牛！但我更牛!  ”',//defendfine
				6 => '“你不懂的话，就不是中国人！”',
				7 => '“这样的伤害还有存在的意义！”',//defendhurt
				8 => '“你们啊！能清醒点儿吗？”',
				9 => '“你做完后，你的心理得到什么样的满足感，你自己清楚！”',//retreat
				10 => '“哎！现在就算听《蜀绣》，我的心情也好不起来！”',//can't counterattack
				11 => '“留下可怜的我独自哀伤，有人同情却无人理解！哎！”',//out of range
				12 => '“水月这个id，老是拿什么必杀技说事，其实是什么都搞不清楚，还一直说！”',//critical
				13 => '“已经被砍死了！大快人心啊！”',
				'color' => 'linen'
				),
			'水月' => Array(
			0 => '“Love your neighbor as yourself.”',//meet
				1 => '“作恶的，必被剪除!”',//attackfine
				2 => '“愚昧人若静默不言，也可算为智慧。闭口不说，也可算为聪明。”',
				3 => '“……”',
				4 => '“……”',
				5 => '“宽恕人的过失，便是自己的荣耀！”',//defendfine
				6 => '“……北斗要讲毛笑话……”',
				7 => '“……唔”',//defendhurt
				8 => '“……”',
				9 => '“……”',//retreat
				10 => '“……”',//can't counterattack
				11 => '“……Avoid godless chatter……”',//out of range
				12 => '“El psy congroo”',//critical
				13 => '“……JOB 38:11”',
				'color' => 'clan'
				),
			'北京推倒你' => Array(
			0 => '“虽然我自称是<span class="blue">历史的眼泪</span>。但很可惜，历史这东西是不相信眼泪的。”',//meet
				1 => '“所谓<span class="red">铁拳无敌</span>，那么就一定是用拳头来证明一切的。”',//attackfine
				2 => '“力道不错，那么该我的反击了！”',
				3 => '“不错啊，也许我也应该重新审视审视你了。”',
				4 => '“很久没有遇到过你这种强力的人物了。”',
				5 => '“离开这里吧，这里不是你这种弱者应该呆的地方。”',//defendfine
				6 => '“离开这里吧，你这种弱者只有再去进行训练才能伤害到我啊。”',
				7 => '“很强，很强啊！”',//defendhurt
				8 => '“唔.....看起来身体有些力不从心了呢。”',
				9 => '“看起来快结束了呢。小心不要一时疏忽领便当了哦。”',//retreat
				10 => '“闪避能力很高啊，但是下一招你还能闪过去吗？”',//can't counterattack
				11 => '“用远程武器打游击战术啊！那么小心，不要让我捕捉到你的身影哦。”',//out of range
				12 => '<span class="white">不知从何而来的数据附着在面前那人的拳头上，使其发出了异样的光芒</span>，“如果说之前都是小意思的话，那么就尝试接下这招吧！”',//critical
				13 => '“弱者，就应该去弱者应该呆的地方。”',
				'color' => 'clan'
			)
		),
		13 => Array(
			'卡玛·克莱因' => Array(
				0 => '“幸会，勇敢的挑战者。我是循环的使者卡玛。”',
				1 => '“我的回合。”',
				2 => '“携带备用武器是我的原则。”',
				3 => '“你们管这个叫什么来着？快枪手？”',
				4 => '“你们管这个叫什么来着？二刀流？”',
				5 => '“你们管这个叫什么来着？武器炼金术士？”',
				6 => '“你们管这个叫什么来着？秒间十割……什么来的？”',
				7 => '“武器不好用啊，看来得换把更称手的。”',
				8 => '“依然受伤了？这批人似乎还不赖。”',
				9 => '“干得不错！在新的世界里再会吧，勇敢的挑战者。”',
				10 => '“换武器的时间还需要缩短。”',
				11 => '“用远程武器？懦弱。”',
				12 => '“破绽百出啊！你真的打算认真打么？”',
				13 => '“呵……想要与我们一较高下，你还有得练呢。”',
				'color' => 'yellow'
			),
			'库特' => Array(
				0 => '“哇呼，被发现了吗！？”',
				1 => '“瞄准旁边攻击的话，不会致死的吧……？”',
				2 => '“为了试验，我必须加油了！”',
				3 => '“随便攻击别人是不对的！”',
				4 => '“就算是斯特勒鲁卡，这个时候也会bite a man的！”',
				5 => '“已经满身疮痍了，怎么样才能结束呢……”',
				6 => '“这样下去会出事的啊，快住手吧！”',
				7 => '“好疼好疼，出手太重了啦！”',
				8 => '“就算是试验，也太乱来了……”',
				9 => '“我……我还不能死在这里……还有人在等着我……！”',
				10 => '“哇呼——这就attack过来了啊！？”',
				11 => '“武器的射程，还不够吗？”',
				12 => '“……这样设定的话，应该能成功吧……？”',
				13 => '“这是我必须做的事，给您添麻烦了……”',
				'color' => 'linen'
			),
			'科学监察 莱卡' => Array(
				0 => '“我似乎沉浸在过去的回忆和相似的人的眷恋里了呢。”',
				1 => '“人类总是在自相残杀……你觉得呢？”',
				2 => '“以前那个不愿意开枪的小女孩，早已被暴徒杀死了。”',
				3 => '“You are a good rival. Counterattack.”',
				4 => '“就没思考过，这种冤冤相报的循环，会导致自灭么？”',
				5 => '“曾经……我也像你一样，有着单纯而快乐的生活。”',
				6 => '“可惜有一天，残酷的命运碾碎了我，就像巨大的机器碾碎变形的齿轮一样。”',
				7 => '“当我再次醒来的时候，属于我的世界已经不存在了。”',
				8 => '“那种踽踽独行的滋味，像你这样的人，难道能理解么！？”',
				9 => '“Dangerous Situation...Retreat.”',
				10 => '“突然袭击呢，很快我们会再会的。”',
				11 => '“射程不足？……怎么会发生这种事？”',
				12 => '莱卡的身后，展开了蝙蝠状的翅膀！<br>“就让你，被牢牢锁死在这濒死的幻想世界里吧，一直到世界崩坏的那一刻……”',
				13 => '“无论是这个世界，还是那个世界，都把你永久放逐了呢。”',
				'color' => 'linen'
			)
		)
	);
}

?>
