<?php if(!defined('IN_GAME')) exit('Access Denied'); include template('header'); if($hp <= 0) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle"><?php } else { echo '___aajx'; } ?><?php echo $stateinfo[$state]?><?php if (!defined('GEXIT_RETURN_JSON')) { ?></div>
<div><IMG src="img/<?php } else { echo '___aajy'; } ?><?php echo $iconImg?><?php if (!defined('GEXIT_RETURN_JSON')) { ?>" width="140" height="80" border="0"align="middle" style="filter: Xray()"></div>
<div class="yellow b"><?php } else { echo '___aajz'; } ?><?php echo $motto?><?php if (!defined('GEXIT_RETURN_JSON')) { ?></div>
<div>
<?php } else { echo '___aajA'; } ?><?php if($dinfo[$state]) { ?>
<?php echo $dinfo[$state]?>
<?php } else { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?>你莫名地死了。这应该是BUG，请通知管理员。
<?php } else { echo '___aajB'; } ?><?php } ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?></div>
<div>死亡时间：<?php } else { echo '___aajC'; } ?><?php echo $dtime?><?php if (!defined('GEXIT_RETURN_JSON')) { ?></div>
<?php } else { echo '___aajD'; } ?><?php if(!empty($kname) && (in_array($state,Array(20,21,22,23,24,28,29)))) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div>凶手：<?php } else { echo '___aajE'; } ?><?php echo $kname?><?php if (!defined('GEXIT_RETURN_JSON')) { ?></div>
<?php } else { echo '___aajD'; } ?><?php } if($state == 33) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div><img src="img/gradius.jpg" align="middle" /></div>
<?php } else { echo '___aajF'; } ?><?php } ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="evergreen2">祝下次游戏好运！</div>
<?php } else { echo '___aajG'; } ?><?php } elseif($gamestate == 0) { if($winmode == 2 && $state == 5) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">游戏结束</div>
<BR>
<p>噗通。<BR>
眼前，浑身是血的网友直勾勾地盯着我，然后跪倒在地。<BR>
血从他身上那可怖的伤口里，像喷泉一样涌出来。<BR>
我和他双目对视，看着他眼中的生命之火迅速熄灭。<BR>
又一个，死了。</p>
<p><span class="yellow">“所以你看到了么，客户，现在这里的情况还很安全。”</span><BR>
<span class="clan">“MISSION COMPLETE，Retreat。”</span><BR>
这些声音……是开局时见到的那两位红杀成员们！她们的声音为什么会直接出现在我的脑海里？<BR>
<span class="yellow">“请稍等片刻，马上就放你出去。好好等着吧。”</span></p>
<p>是嘛……我活下来了啊，最后我终于活下来了啊！哈哈，啊哈哈哈……<BR>
我呆滞地笑着，抬头望向苍天。<BR>
身边的景物开始模糊崩坏。<BR>
虚拟世界的运行，马上就要被停止了吧。这之后，首席执行官们，真的会放我出去吗？<BR>
还是说，他们会把我也一起杀掉？<BR>
不过，我没功夫考虑那么多了。</p>
<p>高度紧绷的心弦断开的一瞬间，睡意便马上袭来。<BR>
数个小时的生死搏斗之后，疲惫的身体开始失去知觉，紧张的神经开始不听使唤。<BR>
不能睡去，要警觉！但是，尽管我拼命地提醒自己，倦意还是把我整个笼罩了。<BR>
视野开始模糊了，我无可挽回地沉入了梦乡。</p>
<p>……<BR>
……<BR>
……</p>
<p>我仿佛又回到了呼啸着血雨腥风的大逃杀战场上。<BR>
被我亲手劈下头颅的网友，又扯着自己的脑袋站起来说道：<BR>
“你比杨叫兽还厉害嘛，人都给你杀光了。”<BR>
在我身后，失去了半个身体的技术帝抱住了我的脚：<BR>
“说什么‘逃出去以后，一起出同人本吧’的人，不是你吗！”<BR>
身旁黑暗的角落更是传来了此起彼伏的怒吼声：<BR>
“傻逼！”<BR>
“干掉他！”<BR>
我就这样任由他们折磨着自己。<BR>
想说点什么，但是嗓子好像被什么攥住了，只有泪水不断地滚落下来。<BR>
……好不容易发出点声音，但是却带着哭腔：<BR>
“不、不是我的错啊！错的……错的是这个世界啊！”</p>
<p>……<BR>
……<BR>
……</p>
<p>身体的摇晃感，让我苏醒过来。<BR>
原来是梦啊，还好……<BR>
我向四周望去，自己似乎身在奇怪的车辆之中。<BR>
旁边身穿黑衣的男子朝这边瞟了一眼，又转过头去。<BR>
这里大概就是现实世界了吧。<BR>
膝盖上有张纸条。拾起一看，只有一行小字：<BR>
<span class="evergreen">“待会见记者。不要做你不该做的事。林无月”</span><BR>
林无月……那两个佣兵刺客的雇主吗……<BR>
这难看而冷酷的词句让我刚刚放下的心再度悬了起来。<BR>
就算逃到现实中，也还是没法摆脱这种梦魇吗？</p>
<p>突然，车门打开了。让人睁不开眼的闪光灯的浪潮中，无数话筒伸了过来。<BR>
我漠然地抬起头。<BR>
挤到最前排的记者们推搡着，在警察的阻挡下努力向我靠近。<BR>
一个看不清的面孔凑了上来，拿着话筒像连珠炮一样发问着：<BR>
“……你是这次ACFUN动漫祭事故的唯一生还者吧？<BR>
“我们XX网络电视频道向对你做个简单的采访……首先你的名字是？……”<BR>
未曾料到的情况冲击着我的神经。<BR>
事故？这是怎么回事？……</p>
<p>身旁的男子此刻站起来挡住记者的视线：<BR>
“他因为冲击而失忆了，请不要刺激他。”<BR>
趁警察和记者正推搡着，男子想要把我重新拽回车里去。</p>
<p>冲击？失忆？……<BR>
难道……<BR>
在我昏睡的时候，那力量……<BR>
把一切都篡改了吗？</p>
<p>不过，不论如何，这是在现实世界。<BR>
这不是大逃杀的野蛮国度，而是有法律的文明世界。<BR>
不会再有你死我活的追杀和赤裸裸的生命威胁了。<BR>
只要我把一切说出，众目睽睽之下，就算神通广大如他们，也没法把我怎么样吧！<BR>
我下定了决心。</p>
<p>在下一个闪光亮起的一瞬间，我挣脱了男子的手臂，然后向记者们冲去。<BR>
一边跑着，一边以人生中最高亢的声调喊出：<BR>
<span class="yellow">“ <?php } else { echo '___aajH'; } ?><?php echo $sexinfo[$gd]?><?php echo $sNo?>号，<?php echo $name?><?php if (!defined('GEXIT_RETURN_JSON')) { ?> ”</span><BR>
然后，不顾众人惊愕的目光，<BR>
以自己都不敢相信的语速，<BR>
将这次大逃杀的参与者，也就是死在我手下的众网友们的名字，一一报出。</p>
<p>支撑着我胜出的，是对那渺茫的希望的追求。<BR>
我要逃出这个虚拟的魔窟，<BR>
我要把实情告诉每一个人，<BR>
我要让那些不可理喻的幕后力量，<BR>
那些以净化网络的名义，践踏我们的生命的狂人们，<BR>
受到他们应有的制裁！</p>
<p>为了这样做，就只能……<BR>
就只能，取得这场生存游戏的胜利……<BR>
就只能，把原本在同一阵线的网友们，全部杀光……</p>
<p>诚然，下这样的决心并不容易。<BR>
然而，这就是，我的信念。<BR>
我要用自己的这双手，<BR>
这双沾满人类鲜血的手，<BR>
亲手撕开他们虚伪的面皮！</p>
<p>所以，被我杀害的网友们啊……<BR>
被我杀害的技术帝们啊……<BR>
所有被我杀害的，那一个一个鲜活的生命们啊……<BR>
我会继承你们的生命，<BR>
带着你们的仇恨，<BR>
怀着你们的希望，<BR>
活下去。<BR>
努力地活下去。<BR>
就算后半生只能在噩梦中挣扎，<BR>
就算今后的笑容里都带着泪光，<BR>
我也要、我也要……</p>
<p>“大家，都死了……<BR>
“但是、大家都在这里，都活在这里啊！”<BR>
此时此刻，我已泣不成声。</p>
<p>接下来，在表情错愕的警察面前，<BR>
在震惊之余记录下每一句话的记者面前，<BR>
在捂住嘴巴不敢发声的围观的路人面前，<BR>
我克制着自己的悲痛，<BR>
努力地、一字一句地，<BR>
将那十数个小时的地狱之行，和盘托出。</p>
<p>……<BR>
……<BR>
……</p>
<p>某月某日，空无一人的ACFUN动漫祭会场。<BR>
参加会展的仪器都已经搬空，偌大的会场里，只有大屏幕还在显示着新闻。<BR>
“……警方对前段日子的动漫祭特大恶性杀人事件的调查已经告一段落，现在让我们来回顾一下事件的始末……”<BR>
会场里仅有的一名黑衣男子，似乎对这爆炸性的新闻丝毫不感兴趣，自顾自地打着手机。<BR>
“你们两个人对赏金还满意么？”<BR>
<span class="lime">“酬金已经收到……您出手可真大方”</span>女子的声音。<BR>
“哼哼，就算被时空特使注意到了也没用吧……”男子笑道，随后压低了声音，“这次的行动十分顺利。那么，下次也请你们多多关照了。”<BR>
<span class="clan">“哎呀呀，终于能自由说话了真好，总是指令啥的闷死了……”</span>另外一个轻快的声音。<BR>
“不知道么蓝凝，那个也是萌属性的一种……总之现在不是插科打诨的时候，改日继续联系。”<BR>
男子挂上了手机，嘴边抹出一个微笑：“做的很不错啊，你们……”</p>
<?php } else { echo '___aajI'; } ?><?php } elseif($winmode == 3 && $state == 6) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">游戏紧急中止</div>
<BR>
<p>“哈……哈……”我疲惫地呼吸着。<br>
三名幻影执行官，之前在开幕仪式上口出狂言的家伙们，如今都面朝下静静地躺在血泊之中。<br>
如以前的生存者们传说的那样，他们很强。但是，仍然不敌我的攻击而倒下了。<br>
他们原本威武的制服已经被我的攻击撕碎，同他们三人的身躯一样千疮百孔。<br>
这样的身躯，绝然不会再有生还的希望。<br>
“这是报应，恶魔们。”我朝尸体的方向恶狠狠地啐了一口。<br>
忽然，倒在地上了无生气的尸体仿佛变得透明了。<br>
我吃了一惊，定睛再望，地上哪里还有他们三人的踪影。</p>
<p><span class="evergreen">“能够将咱的首席执行官们击倒，真是可喜可贺。”</span><br>
一名女子的声音响起，似乎是直接从我的脑内传出。<br>
“谁！？”我手持武器四面环顾，周围一个人都没有。<br>
<span class="evergreen">“咱是林无月，ACFUN动漫祭的董事长，也是这个虚拟世界的主人。”<BR>
“首席执行官都是咱亲自挑选的精英，能将他们打败，你的力量不可小觑。”<BR>
“不过，这整个虚拟现实世界，都在咱的掌控之下。”<br>
“也就是说，咱随时可以将你直接抹杀。”<BR>
“但是看在你的努力的份上，咱就给你一次离开的机会。”</span><br>
林无月的语气听上去就像在评论一部三流新番，<br>
<span class="evergreen">“那么，这是给你的奖品，好好利用吧。”</span><br>
随着声音的消失，我的手中凭空出现一张钥匙卡。<br>
这大概就是中止这场闹剧的关键了吧。</p>
<p>“GAME OVER！这个游戏已经完了！”我利用钥匙赋予的通讯机能向所有仍生还的网友们宣布，“已经不用再互相残杀了！”<br>
之后，兴味索然地坐了下来。<br>
什么“奖品”……难道我们只不过是玩具吗？<br>
难道我们的生命就跟玩具一样，应当受人摆弄吗？……<br>
一开始说什么“净化网络风气”，但是这样的活动，只会让人心变得更加扭曲吧！？<br>
这样的行径，怎么可以容忍……<br>
怎么能就这样善罢甘休！<br>
意识深处早已义愤填膺，但是我强忍怒火，装作懒洋洋地把玩着已经失去意义的武器。</p>
<p>让我克制下来的不只是劳累和伤痛。<br>
还有，在之前的你死我活的战斗中被我有意无意忽略掉的，理性。<br>
仔细想来，她说的一点没错。<br>
就凭我的攻击，什么都做不到。<br>
她就是这个世界的管理员，只要她愿意，什么都能办到。<br>
禁区的创造、对入侵系统的人的惩罚，还有许许多多蛛丝马迹……<br>
诚然我能够在游戏中胜出，<br>
诚然我可以击败她最得力的手下们，<br>
但是，如果我要面对的是整个世界，<br>
整个完全按这个女人的意志运行的世界……<br>
我还能够与之对抗吗？<br>
我歪着脑袋，思考着这个问题。</p>
<p>……<BR>
……<BR>
……</p>
<p>远处，收到游戏结束消息的残存的网友们，正互相搀扶着朝这里聚集而来。<br>
很快，整个世界都将崩溃，而还活着的人将回到现实。这是游戏解除钥匙告诉我的事。<br>
目的地？也许是那个数小时前还被友谊与激情填满的会场吧。<br>
还活着的每个人都能回去，这还真是一个皆大欢喜的结局。 真是这样么？</p>
<p>当然不是这样。<br>
“每个人都能分到补给品！不准争抢！”<br>
虽然游戏已经终止了……<br>
可是黑暗的种子，已经在参与游戏的每一个人心中深处生根发芽，开出黑色的花朵。<br>
为了抢夺剩下的一点补给，好些人都有意无意地下了狠手。<br>
虽然由于我的干预，没能酿成惨剧，<br>
但是我明白，他们惧怕的不是道德的底线，而是我手中的棍棒。<br>
也许沐浴了血雨之后，人们便不再相信阳光。<br>
那一双双狼一般的眼神，宣示着每个人心底的恶魔的苏醒。<br>
自己曾经奋力保护的网友们却变成这个穷凶极恶的样子，这让我也觉得非常沮丧。<br>
更让我恐惧的是，我心里也似乎有一只魔鬼，在引诱我抡起棍棒，挨个敲开面前每个人的脑壳。<br>
万幸的是，现在我还能克制得住。<br>
但是这嗜血的欲望挥之不去，而且不断滋长着。<br>
也许最终它会把我完全控制，然后掀起腥风血雨。<br>
这样的我们，这样的我，还能回到原来的那个世界去么？</p>
<p>而且，那个女人和她的组织肯定不会善罢甘休的。<br>
也许回到现实之后，还有更可怕的噩梦在等待着我们。<br>
林无月带来的。网友们带来的。我带来的。<br>
那么，接下来应该怎么办呢？</p>
<p>怎么办？不是已经有答案了吗？<br>
如果被惨剧包围，那就把那噩梦的源头撕碎。<br>
如果被血雨笼罩，那就把那鲜红的积云扑杀。<br>
一切的根源，在于林无月。<br>
只要能真正打倒了她，那么我们这些受害者大概也就能得到救赎了吧？<br>
不，没有大概。<br>
一定会的。<br>
一定是的，<br>
所以，要击败林无月。<br>
击败她。<br>
击败她！<br>
击败她！！！<br>
如果我还不能击败她，那就变得比她更强！<br>
直到她再也不能伤我分毫！<br>
直到这个世界也不能阻止我掀翻它的步伐！</p>
<p>……</p>
<p>在世界崩溃之际，我握紧拳头，将手臂高举着伸向苍天。<br>
如果能看到自己的面庞，那么我脸上洋溢着的笑容想必连自己也会感到惊讶。</p>
<p><span class="yellow">“我是，<?php } else { echo '___aajJ'; } ?><?php echo $sexinfo[$gd]?><?php echo $sNo?>号，<?php echo $name?><?php if (!defined('GEXIT_RETURN_JSON')) { ?>。”<br>
“我还会再回来的。”<br>
“走着瞧吧，林无月！”</span></p>
<p>……<BR>
……<BR>
……</p>
<p>“对不起，董事长阁下。我们没能阻止这批玩家。”<br>
<p>“MISSION……任务失败。”<br>
不知何时，不知何地，不知何人，正诚恳地道歉着。<br>
<span class="evergreen">“也许那就是咱要找的人吧？拥有能改变整个网络的力量的人……”</span>一个女子的声音，从虚空中传来。<br>
<span class="yellow">“要不是时空特使来搅局……”</span><br>
<span class="evergreen">“时空特使卷入了这次事件么，那还真是意料之外……算了，你们没有什么过错。毕竟对手是他。”</span><br>
<span class="clan">“那个人看起来很强的样子……”</span>另外一个女子的声音。<br>
<span class="yellow">“嗯，我也只能和他打成平手，要不是他中途撤了……”</span>红杀将军卸下了自己的盔甲。<br>
<span class="evergreen">“所以说了不怪你们。”</span>神秘的女子发出了一声叹息，<span class="evergreen">“如果他要来搅局的话那就随他去吧。他是做不出什么翻天动地的事情的。”</span><br>
“了解，<span class="evergreen">Genetic Altered
No.3 alter，林无月</span>阁下。”</p>
<?php } else { echo '___aajK'; } ?><?php } elseif($winmode == 3) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">游戏紧急中止</div>
<BR>
<p>脑海中突然传出的声音，让正忙于厮杀的众人不约而同地停了下来。<BR>
本以为会是首席执行官播报禁区的话语，但却是另一个似曾相识的声音。<BR>
“GAME OVER！这个游戏已经完了！已经不用再相互残杀了！”</p>
<p>真的吗？众人面面相觑。<BR>
不过，既然首席执行官没有加以干涉，或许这个人说的话是可以相信的。<BR>
难以想象，本以为必然血流成河的这个“游戏”，竟然会以这种方式结束。</p>
<p>“10分钟后会解除所有人的锁定，返回现实世界。还活着的人都给我聚集到管理后台来。”</p>
<p>刚才还打个你死我活的网友，此刻正有说有笑地向后台走去。<BR>
但是，在欢声笑语的间隙，总会感受到狐疑的眼神的窥视。<BR>
大家正结伴而行。<BR>
大家正踽踽独行。<BR>
数个小时的生死搏杀带来的心灵创伤，或许终此一生都无法磨灭吧。<BR>
那么，接下来应该怎么办呢？</p>
<p>怎么办？不是已经有答案了吗？<BR>
就算永远也无法再次互相信任也好。<BR>
就算等待着我们的是难以想象的梦魇也好。<BR>
至少我们还生还。至少我们还能互相理解。<BR>
那么，就这样走下去吧。<BR>
和网友们一同走下去。</p>
<p>……<BR>
……<BR>
……</p>
<p>“对不起，董事长阁下。我们没能阻止这批玩家。”<br>
<p>“MISSION……任务失败。”<br>
不知何时，不知何地，不知何人，正诚恳地道歉着。<br>
<span class="evergreen">“也许那就是咱要找的人吧？拥有能改变整个网络的力量的人……”</span>一个女子的声音，从虚空中传来。<br>
<span class="yellow">“要不是时空特使来搅局……”</span><br>
<span class="evergreen">“时空特使卷入了这次事件么，那还真是意料之外……算了，你们没有什么过错。毕竟对手是他。”</span><br>
<span class="clan">“那个人看起来很强的样子……”</span>另外一个女子的声音。<br>
<span class="yellow">“嗯，我也只能和他打成平手，要不是他中途撤了……”</span>红杀将军卸下了自己的盔甲。<br>
<span class="evergreen">“所以说了不怪你们。”</span>神秘的女子发出了一声叹息，<span class="evergreen">“如果他要来搅局的话那就随他去吧。他是做不出什么翻天动地的事情的。”</span><br>
“了解，<span class="evergreen">Genetic Altered
No.3 alter，林无月</span>阁下。”</p>
<?php } else { echo '___aajL'; } ?><?php } elseif($winmode == 5 && $state == 6) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">核弹引爆</div>
<BR>
<p>手中的按钮装置发出刺耳的“哔哔”声。<BR>
真烦，不赶快把这东西丢掉的话，肯定会暴露位置，招来别人的攻击。</p>
<p>“啪。” 看着砸在坚硬的岩石上粉身碎骨的按钮，我感到如释重负般的开心。<BR>
接下来怎么办呢？先继续躲藏吧。马上到整点禁区的时间了，我抬头望着天空，判断着大致的时间。<BR>
忽然，我似乎看到了什么。<BR>
远处的天空中，一颗明亮的星星，渐渐显露出来。<BR>
定睛看去，那其实不是星星，是飞行器一般的东西，正高速划破天空，身后留下清晰可见的尾迹。<BR>
“如果是飞机，那个速度也太快了……”我一边这样想着，一边想转身离开。<BR>
但是，心脏好像被什么拽住了一样，毛骨悚然的感觉瞬间爬满全身，整个人一动也不能动。<BR>
“它在朝这个岛屿飞来……”我失神地望着那越来越近的飞行物体。<BR>
高速飞行的东西已经很近了，圆锥形的脑袋在阳光下反射着耀眼的金光。<BR>
“是导弹啊！该死……”话音未落，我就被千万倍亮于太阳的刺眼光芒所淹没了。</p>
<p>“眼睛、眼睛看不见了！”眼前一片白茫茫，如同患了白内障一般。<BR>
狂风从四面八方涌来，自己被卷到空中，就像破抹布一样被撕扯着。<BR>
再然后，犹如跌入了火焰地狱，皮肤似乎瞬间就蒸发了，灼热的感觉从肺里传来，好像连血液都在沸腾。<BR>
意识早已模糊了。仅存的感觉，是大概早已如枯骨一般的手指，攥着正在融化的武器。<BR>
“可恶……早知道这样，就……”</p>
<p>崩坏的感官最终归于沉寂。</p>
<p>……<BR>
……<BR>
……</p>
<p>“对不起，董事长阁下，”不知何处，不知何人的声音，“我们没能阻止电子病毒核弹的引爆。”<BR>
<span class="evergreen">“哼，看来也许下次还得我亲自出马。”</span>不满的女声，<BR>
<span class="evergreen">“不过，电子病毒核弹这样的东西，竟然会被安插到那里。看来我们需要重新审视内部的暗流了呢。”</span><BR>
“实在抱歉，董事长。这次的事情由我们负全责。”<BR>
<span class="evergreen">“咱不在的时候竟然有人敢做这种事……”女声沉吟许久，“果然是他……？”</span></p>
<?php } else { echo '___aajM'; } ?><?php } elseif($winmode == 5) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">核弹引爆</div>
<BR>
<p>突然间划破天空的飞行物体，让正在厮杀的众人不约而同地停了下来。<BR>
那震耳欲聋的尖锐呼啸声，让人不寒而栗。<BR>
“啪”是网友的武器掉落在地上的声音。<BR>
“不好！那东西——快逃——”<BR>
话音未落，那飞行物体就坠落在岛屿的中心位置。随之而来的强烈闪光让所有人的眼睛都一阵烧灼。<BR>
“核弹……？”刚才还血战着的技术帝，此刻呆若木鸡。烧焦的碎屑从他朝向爆炸点的皮肤上片片剥落。<BR>
有网友反应过来，扭头就跑，还没跑出两步，就被呼啸而至的巨大的冲击波压倒在地……</p>
<p>世界在燃烧。<BR>
骨头似乎都碎了，沸腾的血液连同熟透的器官一起洒了一地，千疮百孔的身体如同破娃娃，支撑着自己活到现在的信念早已分寸尽断。<BR>
“是谁……引爆了核弹？”沙哑的、夹杂着咕噜声的非人类的声音有气无力地喃喃道。<BR>
“如果……还有……一定要……爆ta菊花……哈、哈哈……”</p>
<p>崩坏的感官最终归于沉寂。</p>
<p>……<BR>
……<BR>
……</p>
<p>“对不起，董事长阁下，”不知何处，不知何人的声音，“我们没能阻止电子病毒核弹的引爆。”<BR>
<span class="evergreen">“哼，看来也许下次还得我亲自出马。”</span>不满的女声，<BR>
<span class="evergreen">“不过，电子病毒核弹这样的东西，竟然会被安插到那里。看来我们需要重新审视内部的暗流了呢。”</span><BR>
“实在抱歉，董事长。这次的事情由我们负全责。”<BR>
<span class="evergreen">“咱不在的时候竟然有人敢做这种事……”女声沉吟许久，“果然是他……？”</span></p>
<?php } else { echo '___aajN'; } ?><?php } elseif($winmode == 6) { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><div class="subtitle">游戏被GM中止</div>
<BR>
<p>本局游戏被GM中止，请返回游戏首页。</p>
<?php } else { echo '___aajO'; } ?><?php } else { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?>不明错误，请返回游戏首页！
<?php } else { echo '___aajP'; } ?><?php } } else { ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?>不明错误，请返回游戏首页！
<?php } else { echo '___aajP'; } ?><?php } ?>
<?php if (!defined('GEXIT_RETURN_JSON')) { ?><form method="post" name="backindex" action="index.php">
<input type="submit" name="enter" value="返回首页">
</form>
<?php } else { echo '___aajQ'; } ?><?php include template('footer'); ?>

